{
  "backend/main.mo": "Main Motoko canister implementing authorization, user profiles, product/catalog models, carts, orders, and initialization with demo data.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, light/dark themes, and global element styles.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React application configuring TanStack Router routes, theme provider, authentication, and profile setup modal.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Dialog component for creating or editing products with form validation and category selection.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects routes by checking authentication and admin status, showing alerts or loading states until access is validated.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for creating a user profile with name and optional email, submitting via a save mutation.",
  "frontend/src/components/feedback/ErrorAlert.tsx": "Displays a styled error alert with a title and message.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper providing top navigation, footer, and routed page content.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with branding, links, and design credits.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar with links, cart status, user menu, admin link, and authentication handling.",
  "frontend/src/components/products/ProductCard.tsx": "Displays a product’s image, title, description, price, and stock status in a navigable card.",
  "frontend/src/components/products/ProductGrid.tsx": "Shows a grid of products or skeleton loaders, with a fallback message when empty.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the current identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, products, categories, cart data, and related mutations using the actor.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables plus base styles.",
  "frontend/src/lib/validation.ts": "Provides client-side validation for product forms, checkout forms, and quantity inputs.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AccountPage.tsx": "Displays user profile details and quick actions, including logout and navigation links.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin overview displaying totals for products, orders, revenue, and navigation to management pages.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin view listing all orders with customer info, totals, and links to order detail pages.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin page listing products with add, edit, delete, and demo initialization actions using dialogs and query hooks.",
  "frontend/src/pages/CartPage.tsx": "Shows cart items with product details, supports quantity updates and removal, and displays cart totals.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow including address input, validation, order submission, and order summary display.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero banner, popular products, and feature highlights.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details and provides navigation to orders or continued shopping.",
  "frontend/src/pages/OrderDetailPage.tsx": "Displays details for a single order, including items, totals, and shipping info, fetched by orderId.",
  "frontend/src/pages/OrdersPage.tsx": "Lists a user's past orders with dates, totals, and a link to each order's detail page.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows product information, stock status, analytics, and allows authenticated users to add items to the cart.",
  "frontend/src/pages/ShopPage.tsx": "Provides a browsable product catalog with search, category filters, and sorting options.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, storing them in sessionStorage, and managing persisted or hash-based params.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, shadows, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current features, requirements, issues, and image needs for an e‑commerce app."
}