{
  "backend/main.mo": "Motoko canister implementing authorization, user profiles, product catalog, categories, orders, carts, and comparison utilities with stable maps and initialization demo data.",
  "feature_evidence.json": "Empty feature evidence report containing no collected features.",
  "frontend-file-summaries.txt": "Plain-text JSON mapping frontend file paths to short summaries for documentation or build reference.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions providing a warm OKLCH color theme with light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Defines the full TanStack Router setup, theme provider, authentication checks, and profile setup modal gating.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Dialog UI for adding or editing products with validation, category selection, and backend mutations.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Wraps admin-only pages with authentication and admin-role checks, showing alerts when access is denied.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting first‑time users to enter name and optional email before continuing.",
  "frontend/src/components/feedback/ErrorAlert.tsx": "Reusable error alert component showing a title and message.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout wrapping pages with top navigation, main outlet, and footer.",
  "frontend/src/components/layout/Footer.tsx": "Renders a footer with branding, links, and a caffeine.ai attribution.",
  "frontend/src/components/layout/TopNav.tsx": "Implements the top navigation bar with auth handling, cart badge, mobile menu, and conditional admin/user links.",
  "frontend/src/components/products/ProductCard.tsx": "Displays a product card with image placeholder, details, price, and stock status linking to product detail page.",
  "frontend/src/components/products/ProductGrid.tsx": "Shows a responsive grid of ProductCards with loading skeletons and empty-state handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, products, categories, and cart data via the actor.",
  "frontend/src/index.css": "Configures Tailwind CSS and defines light/dark theme CSS variables for the app’s design system.",
  "frontend/src/lib/validation.ts": "Contains validation helpers for product forms, checkout forms, and quantity inputs.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccountPage.tsx": "Displays user profile info, quick actions, and handles logout using Internet Identity and navigation.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin overview showing total products, orders, and revenue, with navigation to product and order management.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all orders with loading and empty states, showing order summaries and linking to detailed views.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin product management table with add, edit, delete, and demo‑data initialization actions.",
  "frontend/src/pages/CartPage.tsx": "Shows cart items with product details, allows updating quantities and removing items, and displays cart total.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout by collecting shipping address, validating input, showing cart summary, and submitting the order.",
  "frontend/src/pages/HomePage.tsx": "Renders hero section, popular products, and feature highlights with navigation to shop.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details and provides navigation to orders or shopping.",
  "frontend/src/pages/OrderDetailPage.tsx": "Shows detailed information for a specific order including items, totals, and shipping address.",
  "frontend/src/pages/OrdersPage.tsx": "Lists user order history with totals and timestamps, with links to detailed views.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product info, handles add‑to‑cart logic with authentication checks, and shows loading and not‑found states.",
  "frontend/src/pages/ShopPage.tsx": "Lists products with search, category filtering, and sorting, fetching data from multiple product query hooks.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theme settings, custom colors, fonts, shadows, and animation keyframes.",
  "project_state.json": "Stores project metadata including versions, feature requests, and project status for adding flower products to the demo catalog."
}