{
  "kind": "build_request",
  "title": "Add flower products to demo catalog",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new product category named \"Flowers\" in the backend demo initialization flow, and create multiple flower products under that category so they appear in the storefront product list, search results, and category filter after an admin runs \"Initialize Demo Data\".",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "add some flower product"
        ]
      },
      "acceptanceCriteria": [
        "When an admin calls backend.initialize(), backend.listCategories() includes a category with name exactly \"Flowers\".",
        "When an admin calls backend.initialize(), backend.listProducts(null, null) returns at least 3 products whose categoryId matches the \"Flowers\" category.",
        "Each flower product has a non-empty English title and description, a non-zero price (in cents, consistent with existing products), and a stock value greater than or equal to 0.",
        "In the Shop page category dropdown, selecting the \"Flowers\" category shows only the flower products returned by backend.filterProductsByCategory(flowersCategoryId).",
        "Searching from the Shop page for a flower-related keyword (e.g., \"rose\" or \"bouquet\") returns at least one of the newly added flower products via backend.searchProducts(keyword)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit frontend files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for all user-facing catalog text (product titles/descriptions/category names)."
  ],
  "nonGoals": [
    "Adding product images or an image upload system for products.",
    "Changing the product data model/schema beyond adding new demo entries."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}